Repository: agatinet31/foodgram-project-react
Catalog: backend/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Enter a valid string value consisting of only letters.
ru: Введите валидную строку, содержащую только буквы

source: The valid hexadecimal color code must satisfy the following conditions:1. It should start from ‘#’ symbol.2. It should be followed by the letters from a-f, A-F and/or digits from 0-9.3. The length of the hexadecimal color code should be either 6 or 3, excluding ‘#’ symbol.
ru: Валидный шестнадцатеричный код цвета должен удовлетворять следующим условиям:1. Он должен начинаться с символа «#».@2. За ним должны следовать буквы от a до f, от A до F и/или цифры от 0 до 9.3. Длина шестнадцатеричного кода цвета должна быть 6 или 3, за исключением символа «#».

source: Enter a valid `tag` value consisting of only letters, digit. The first symbol can be `#`.
ru: Введите валидное значение тега, содержащее только буквы и цифры.Первый симмвол может быть `#`.

source: Enter a valid `name` value consisting of only letters, digit. and symbols _ ( )The first symbol only letter.
ru: Введите валидное значение наименования, содержащее только буквы, цифры и символы _ ``( )Первый символ должен быть буквой.

source: empty
ru: пусто

source: name
ru: наименование

source: Required. Enter tag name, please. 150 characters or fewer. Letters, digit onlyand first symbol can be `#`
ru: Обязательное поле. Введите наименование тега. 150 символов или менее.Буквы, цифры. Первый символ может быть `#`.

source: A tag with that name already exists.
ru: Тег с таким именем уже создан.

source: color HEX-code
ru: цвет (HEX-код)

source: Required. Enter HEX-code color, please.
ru: Обязательное поле. Введите HEX-код цвета.

source: A tag with that color already exists.
ru: Тег с данным цветом уже создан.

source: slug
ru: слаг

source: Required. Enter slug tag, please.
ru: Обязательное поле. Введите слаг тега.

source: A tag with that slug already exists.
ru: Тег с указаным слагом уже создан.

source: tag
ru: тег

source: tags
ru: теги

source: Required. Enter ingredient name, please. 250 characters or fewer. Letters, digit symbols _(). The first symbol only letter.
ru: Обязательное поле. Введите наименование ингридиента. 250 символов или менее.Буквы, цифры и символ _(). Первый символ только буква.

source: A ingredient with that name already exists.
ru: Ингридиент с таким наименованием уже создан.

source: measurement_unit
ru: единица измерения

source: Required. Enter measurement_unit, please.
ru: Обязательное поле. Введите единицу измерения.

source: ingredient
ru: ингридиент

source: ingredients
ru: ингридиенты

source: Required. Enter name recipe, please.
ru: Обязательное поле. Введите наименование рецепта.

source: author
ru: автор

source: Required. Enter author, please.
ru: Обязательное поле. Введите имя автора.

source: favorites
ru: избранное

source: shopping_carts
ru: список покупок

source: public date
ru: дата публикации

source: image
ru: изображение

source: recipe text
ru: текст рецепта

source: cooking_time
ru: время приготовления

source: Minimum cooking time 1 minute
ru: Минимальное время приготовления 1 минута.

source: recipe
ru: рецепт

source: recipes
ru: рецепты

source: amount
ru: количество

source: The minimum quantity of an ingredient in a recipe is 1
ru: Минимальное количество ингридиентов в рецепте 1

source: recipe ingredient
ru: ингридиент рецепта

source: recipe ingredients
ru: ингридиенты рецепта

source: first name
ru: имя

source: Required. Enter first name, please. 150 characters or fewer. Letters only.
ru: Обязательное поле. Введите имя. 150 символов или меньше. Только буквы.

source: last name
ru: фамилия

source: Required. Enter last name, please. 150 characters or fewer. Letters only.
ru: Обязательное поле. Введите фамилию. 150 символов или меньше. Только буквы.

source: Required. A valid email address, please. 254 characters or fewer. Letters, digits and @/./+/-/_ only.
ru: Обязательное поле. Введите валидный адрес электронной почты.254 символа или менее. Буквы, цифры и символы @/./+/-/_.

source: A user with that email already exists.
ru: Пользователь с таким адресом электронной почты уже существует.

source: password
ru: пароль

source: subscribed
ru: подписан

source: Subscribed for this user.
ru: подписки пользователя

source: date subscriber
ru: дата подписки

source: subscriber
ru: подписка

source: subscribers
ru: подписки

source: User cannot follow himself.
ru: Пользователь не может подписаться на себя.

source: The ME username is reserved. Specify another please.
ru: Имя пользователя МЕ зарезервировано. Укажите другое пожалуйста.

source: colored_name
ru: Цвет
